app/views/rentals/_form.html.haml

SELECT "spaces".* FROM "spaces" WHERE "spaces"."rental_id" = ?  [["rental_id", 9]]
---
                        - if @action == 'edit'
                          - @rental.spaces.each do |detail|

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "type_of_cars".* FROM "type_of_cars" WHERE "type_of_cars"."id" = ? LIMIT 1  [["id", 2]]
---
                                %label.field{:for => "name"}
                                  %input{:name => "rental[spaces_attributes][" + @reg_n.to_s + "][type_of_car_id]", :placeholder => "Nombre", :type => "text", :value => (TypeOfCar.find(detail.item_asset_id).name)}