app/views/rentals/_table.html.haml

              %td
                = City.find(rental.city_id).name.to_s
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]