app/views/reservations/_table.html.haml

              %td
                = Space.find(reservation.space_id).name.to_s
---
SELECT  "spaces".* FROM "spaces" WHERE "spaces"."id" = ? LIMIT 1  [["id", 14]]