app/views/surveys/_form.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
                %label.field.prepend-icon{:for => "user_id"}
                  - nombre1 = User.find(@user_id).names.to_s + ' ' + User.find(@user_id).last_names.to_s