app/views/surveys/_table.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
              %td
                = User.find(survey.user_id).names.to_s + ' ' + User.find(survey.user_id).last_names.to_s