app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars" WHERE (user_id = 7)
---
  def index
    @cars = Car.all

SELECT "type_of_cars".* FROM "type_of_cars"
---
  def new
    @type_of_cars = TypeOfCar.all

INSERT INTO "cars" ("placa", "type_of_car_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["placa", "1asdc3"], ["type_of_car_id", 2], ["description", "Auto Pequeño"], ["created_at", "2016-03-31 03:57:14.727162"], ["updated_at", "2016-03-31 03:57:14.727162"]]
---
  def create
    car = Car.new(params_car)
    car.user_id = current_user.id
    car.save