app/controllers/cities_controller.rb

  def create
    city = City.new(params_city)
    city.save
---
INSERT INTO "cities" ("name", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "La Victoria"], ["code", "Lima 13"], ["created_at", "2016-04-09 23:22:43.247111"], ["updated_at", "2016-04-09 23:22:43.247111"]]