app/controllers/rentals_controller.rb

SELECT "rentals".* FROM "rentals" WHERE (user_id = 3)
---
  def index
    @rentals = Rental.all

SELECT "cities".* FROM "cities"
---
  def new
    @cities = City.all

INSERT INTO "rentals" ("space_quantity", "address", "city_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["space_quantity", 1], ["address", "Parinacochas"], ["city_id", 1], ["user_id", 1], ["created_at", "2016-04-09 23:30:01.941974"], ["updated_at", "2016-04-09 23:30:01.941974"]]
---
  def create
    rental = Rental.new(params_rental)
    rental.user_id = current_user.id
    rental.save

SELECT "cities".* FROM "cities"
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @cities = City.all
    @rental = Rental.find(params[:id])

DELETE FROM "rentals" WHERE "rentals"."id" = ?  [["id", 1]]
---
  def destroy
    rental = Rental.destroy(params[:id])

SELECT "type_of_cars".* FROM "type_of_cars"
---
  def addMoreRows
    @type_of_cars = TypeOfCar.all