app/controllers/reservations_controller.rb

  def new
    @cars = Car.all
    @spaces = Space.all
---
SELECT "cars".* FROM "cars"
SELECT "spaces".* FROM "spaces"