app/controllers/reservations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT "reservations".* FROM "reservations" WHERE (space_id IN(SELECT id FROM spaces WHERE rental_id IN(SELECT id FROM rentals WHERE user_id = 1)))
---
  def index
    if current_user.type_of_user_id == 2
      @reservations = Reservation.where("user_id = ?",current_user.id)

SELECT "cars".* FROM "cars" WHERE (user_id = 7)
SELECT "cities".* FROM "cities"
---
  def new
    @cars = Car.where("user_id = ?",current_user.id)
    @cities = City.all

INSERT INTO "reservations" ("car_id", "space_id", "user_id", "status", "owner_survey", "user_survey", "start_hour", "end_hour", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    reservation = Reservation.new(params_reservation)
    reservation.user_id = current_user.id
    reservation.status = "waiting"
    reservation.owner_survey = 0
    reservation.user_survey = 0
    fechadereserva = params[:fecha].to_date
    reservation.start_hour = Time.new(fechadereserva.year,fechadereserva.month,fechadereserva.day, params[:timepicker1][0...2], params[:timepicker1][3...5], 00)
    reservation.end_hour = Time.new(fechadereserva.year,fechadereserva.month,fechadereserva.day, params[:timepicker1][0...2], params[:timepicker1][3...5], 00)
    reservation.save

DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 1]]
---
  def destroy
    reservation = Reservation.destroy(params[:id])

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", 1]]
SELECT "spaces".* FROM "spaces" WHERE (type_of_car_id = 2 AND rental_id IN(SELECT id FROM rentals WHERE city_id = '1'))
SELECT "spaces".* FROM "spaces"
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT 1  [["id", 2]]
---
  def complete
    car_type = Car.find(params[:car]).type_of_car_id
    city = params[:city]
    @combo=Array.new
    @spaces = Space.where("type_of_car_id = ? AND rental_id IN(SELECT id FROM rentals WHERE city_id = ?)",car_type,city)
    @spaces.each do |x|
      @combo << { 'id' => x.id, 'name' => x.name.to_s + 'Direccion: ' + Rental.find(x.rental_id).address.to_s + ' S/.' + x.price.to_s}

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "reservations" SET "status" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["status", "accepted"], ["updated_at", "2016-04-10 00:18:37.504146"], ["id", 4]]
---
  def accept
    reservation = Reservation.find(params[:id])
    reservation.status = "accepted"
    reservation.save

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "reservations" SET "status" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["status", "rejected"], ["updated_at", "2016-04-10 00:18:40.163439"], ["id", 4]]
---
  def reject
    reservation = Reservation.find(params[:id])
    reservation.status = "rejected"
    reservation.save

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "reservations" SET "status" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["status", "cobrado"], ["updated_at", "2016-04-10 04:49:27.602994"], ["id", 5]]
---
  def charged
    reservation = Reservation.find(params[:id])
    reservation.status = "charged"
    reservation.save

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT 1  [["id", 8]]
SELECT  "spaces".* FROM "spaces" WHERE "spaces"."id" = ? LIMIT 1  [["id", 11]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def fill_survey_owner
    reservation = Reservation.find(params[:id])
    reservationuser = Rental.find(Space.find(reservation.space_id).rental_id).user_id

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT 1  [["id", 9]]
SELECT  "spaces".* FROM "spaces" WHERE "spaces"."id" = ? LIMIT 1  [["id", 14]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 7]]
---
  def fill_survey_user
    reservation = Reservation.find(params[:id])
    reservationuser = reservation.user_id
    reservationuser2 = Rental.find(Space.find(reservation.space_id).rental_id).user_id