app/controllers/surveys_controller.rb

  def create
    survey = Survey.new(params_survey)
    survey.save
    reservation = Reservation.find(survey.reservation_id)
    if survey.type_of_survey == 1
      reservation.owner_survey = 1
    else
      reservation.user_survey = 1
    end
    reservation.save
---
INSERT INTO "surveys" ("user_id", "type_of_survey", "object_score", "user_score", "description", "user_id_2", "reservation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "reservations" SET "owner_survey" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["owner_survey", 1], ["updated_at", "2016-04-10 18:55:17.698474"], ["id", 7]]

  def edit
    @survey = Survey.find(params[:id])
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", 1]]