app/controllers/type_of_cars_controller.rb

SELECT "type_of_cars".* FROM "type_of_cars"
---
  def index
    @type_of_cars = TypeOfCar.all

INSERT INTO "type_of_cars" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Auto"], ["description", "Vehiculo pequeño"], ["created_at", "2016-03-31 02:56:49.720442"], ["updated_at", "2016-03-31 02:56:49.720442"]]
---
  def create
    type_of_car = TypeOfCar.new(params_type_of_car)
    type_of_car.save

DELETE FROM "type_of_cars" WHERE "type_of_cars"."id" = ?  [["id", 1]]
---
  def destroy
    type_of_car = TypeOfCar.destroy(params[:id])