app/views/cars/_table.html.haml

              %td
                = TypeOfCar.find(car.type_of_car_id).name.to_s
---
SELECT  "type_of_cars".* FROM "type_of_cars" WHERE "type_of_cars"."id" = ? LIMIT 1  [["id", 2]]
SELECT "cars".* FROM "cars" WHERE (user_id = 7)